[
  {
    "seed_question": {
      "id": 1,
      "question": "人工智能的发展是否会导致大规模失业？",
      "category": "科技与社会",
      "difficulty": "中等"
    },
    "expanded_data": {
      "core_question": "人工智能的发展是否会导致大规模失业？",
      "sub_questions": [
        "哪些行业和职业最容易受到人工智能自动化的冲击？",
        "人工智能会创造哪些新的就业机会和职业类型？",
        "人工智能对就业市场的影响是替代效应还是补充效应？",
        "不同国家和地区对人工智能带来的就业冲击有何不同的应对能力？",
        "教育和培训体系需要如何变革以适应人工智能时代？",
        "政府应该采取哪些政策来缓解人工智能可能带来的失业问题？",
        "人工智能的发展速度与就业结构调整速度之间是否存在时间差？",
        "低技能和高技能工作者受到的影响有何不同？"
      ],
      "key_concepts": [
        "技术性失业",
        "职业替代效应",
        "技能不匹配",
        "人机协作",
        "劳动力市场弹性",
        "再培训与技能提升",
        "基本收入保障",
        "创造性破坏",
        "生产力悖论",
        "就业极化"
      ],
      "perspectives": [
        "技术悲观主义观点：认为人工智能将导致大规模结构性失业，特别是对中低技能工作者造成严重冲击",
        "技术乐观主义观点：认为人工智能将创造更多新工作岗位，提高整体生产力，最终实现就业净增长",
        "转型过渡观点：承认短期内会出现就业冲击，但长期来看市场会通过再培训和结构调整实现新的平衡",
        "制度决定论观点：认为就业影响取决于政府政策、教育体系和社会制度的应对能力",
        "技能偏向性技术进步观点：认为人工智能会加剧技能溢价，导致收入不平等扩大"
      ],
      "possible_conclusions": [
        "人工智能将导致特定行业和职业的大规模失业，但会创造新的就业机会，总体就业可能保持稳定",
        "失业影响具有明显的阶层和技能差异，低技能工作者面临更大风险，需要针对性的社会政策支持",
        "短期内的就业冲击不可避免，但长期来看人类将转向更具创造性和情感智能的工作领域",
        "就业影响的程度和性质很大程度上取决于政策应对和社会适应能力，而非技术本身",
        "人工智能可能推动工作性质的深刻变革，从全职就业向灵活工作和人机协作模式转变",
        "最可能的结果是就业结构的重组而非就业总量的减少，但需要重大的教育和培训体系改革"
      ]
    },
    "timestamp": "2025-08-20 23:52:05"
  },
  {
    "seed_question": {
      "id": 2,
      "question": "在数字化时代，个人隐私是否已经成为一种奢望？",
      "category": "隐私与科技",
      "difficulty": "高"
    },
    "expanded_data": {
      "core_question": "在数字化时代，个人隐私是否已经成为一种奢望？",
      "sub_questions": [
        "数字技术如何改变了隐私的定义和边界？",
        "商业机构在数据收集和使用中扮演什么角色？",
        "政府在隐私保护与国家安全之间的平衡点在哪里？",
        "个人在数字隐私保护中应该承担怎样的责任？",
        "隐私权的丧失对个人自由和社会民主会产生什么影响？",
        "技术解决方案（如加密、匿名化）能在多大程度上保护隐私？",
        "不同文化和社会对隐私的认知和重视程度有何差异？"
      ],
      "key_concepts": [
        "数字隐私",
        "数据所有权",
        "知情同意",
        "监控资本主义",
        "算法偏见",
        "数字足迹",
        "隐私悖论（privacy paradox）",
        "数据商品化",
        "数字权利",
        "技术中立性"
      ],
      "perspectives": [
        "技术决定论观点：数字技术的本质决定了隐私必然消亡，这是技术进步不可避免的代价",
        "乐观主义观点：通过技术手段（如加密、区块链）和立法监管，隐私可以得到有效保护",
        "批判理论观点：隐私的丧失是资本主义体系下数据商品化的必然结果，需要系统性变革",
        "实用主义观点：在便利性和隐私之间需要找到平衡点，完全隐私既不现实也不必要",
        "文化相对主义观点：隐私概念本身是西方现代性的产物，不同文化对隐私有不同理解和需求"
      ],
      "possible_conclusions": [
        "个人隐私确实正在成为奢侈品，只有少数技术精英和富裕阶层能够真正保护自己的隐私",
        "通过完善的法律框架和技术创新，我们可以在数字化时代重建有意义的隐私保护",
        "隐私概念本身需要重新定义，从'隐藏信息'转向'控制信息使用'的新范式",
        "完全的数字隐私是不可能的幻想，社会需要适应新的透明度规范",
        "隐私保护的程度将出现阶层分化，形成新的数字鸿沟和社会不平等"
      ]
    },
    "timestamp": "2025-08-20 23:52:31"
  },
  {
    "seed_question": {
      "id": 3,
      "question": "全球化是否加剧了贫富差距？",
      "category": "经济",
      "difficulty": "高"
    },
    "expanded_data": {
      "core_question": "全球化是否加剧了贫富差距？",
      "sub_questions": [
        "全球化如何影响发达国家与发展中国家之间的收入差距？",
        "全球化对各国国内贫富差距的具体影响机制是什么？",
        "贸易自由化是否导致了资本收益与劳动收益的不平衡分配？",
        "技术转移和知识扩散在全球化中如何影响不同群体的收入水平？",
        "全球供应链的建立是否加剧了发展中国家内部的收入不平等？",
        "金融全球化如何影响财富的集中与分散？",
        "全球化过程中的赢家和输家分别是哪些群体？",
        "政府政策在调节全球化对贫富差距影响中扮演什么角色？",
        "文化全球化是否影响了不同社会阶层的机会平等？"
      ],
      "key_concepts": [
        "全球化",
        "贫富差距",
        "收入不平等",
        "资本流动",
        "贸易自由化",
        "技术扩散",
        "全球价值链",
        "劳动力市场分割",
        "财富集中",
        "机会不平等",
        "经济发展阶段",
        "制度质量"
      ],
      "perspectives": [
        "支持观点：全球化通过资本自由流动和技术转移，使发达国家资本所有者和发展国家精英获益，加剧了全球和国内不平等",
        "反对观点：全球化促进了整体经济增长，通过创造就业和降低商品价格，实际上有助于减少绝对贫困和缩小贫富差距",
        "辩证观点：全球化的影响具有双重性，既可能加剧某些形式的不平等，也可能通过经济发展为减少贫困提供机会",
        "制度决定论：全球化对贫富差距的影响取决于各国的制度安排和政策选择，而非全球化本身",
        "结构主义观点：全球资本主义体系内在的不平等结构决定了全球化必然加剧贫富差距",
        "新自由主义观点：全球化通过市场机制优化资源配置，长期来看将促进更加公平的财富分配"
      ],
      "possible_conclusions": [
        "全球化确实加剧了全球范围内的贫富差距，特别是在资本与劳动收益分配方面",
        "全球化虽然可能加剧某些不平等，但总体上通过促进经济增长减少了绝对贫困",
        "全球化的影响具有地域和群体差异性，不能一概而论",
        "贫富差距的变化更多取决于国内政策和制度因素，而非全球化本身",
        "全球化创造了新的不平等形式，但同时提供了解决这些问题的全球性机遇",
        "需要在推进全球化的同时，建立更加完善的社会保障和再分配机制",
        "全球化对贫富差距的影响是一个动态过程，不同发展阶段可能呈现不同特征"
      ]
    },
    "timestamp": "2025-08-20 23:53:02"
  },
  {
    "seed_question": {
      "id": 4,
      "question": "社交媒体对青少年心理健康的影响是正面还是负面？",
      "category": "教育",
      "difficulty": "中等"
    },
    "expanded_data": {
      "core_question": "社交媒体对青少年心理健康的影响是正面还是负面？",
      "sub_questions": [
        "社交媒体如何影响青少年的自我认同和自尊？",
        "网络欺凌和负面社交互动对青少年心理健康的危害程度如何？",
        "社交媒体使用与青少年焦虑、抑郁等心理问题的相关性如何？",
        "社交媒体能否为青少年提供有益的情感支持和社交连接？",
        "不同使用模式（主动vs被动使用）对心理健康的影响有何差异？",
        "社交媒体内容算法如何影响青少年的心理状态和价值观形成？",
        "家庭和学校应该如何引导青少年健康使用社交媒体？",
        "社交媒体平台在保护青少年心理健康方面应承担什么责任？"
      ],
      "key_concepts": [
        "社交媒体成瘾",
        "网络欺凌",
        "FOMO（错失恐惧症）",
        "社会比较理论",
        "数字身份建构",
        "屏幕时间",
        "网络社交资本",
        "算法推荐机制",
        "数字健康素养",
        "心理弹性"
      ],
      "perspectives": [
        "消极观点：社交媒体导致社交孤立、身体意象问题、网络成瘾和心理健康恶化",
        "积极观点：社交媒体提供情感支持、身份探索机会和弱势群体的归属感",
        "中庸观点：影响取决于使用方式、内容和个体差异，不能一概而论",
        "技术决定论：平台设计和算法是影响心理健康的关键因素",
        "社会文化视角：反映和放大了现实社会中已有的心理压力和社交问题",
        "发展心理学视角：青春期特有的心理特征使其对社交媒体影响特别敏感"
      ],
      "possible_conclusions": [
        "社交媒体对青少年心理健康的影响是复杂且多维的，既有风险也有机遇",
        "适度、有意识的社交媒体使用可能产生积极影响，而过度和被动使用则带来风险",
        "需要建立综合的干预体系，包括平台责任、家庭教育、学校教育和个体素养提升",
        "未来的研究应该更多关注不同亚群体（如性别、社会经济地位）的差异化影响",
        "关键在于培养青少年的数字健康素养和批判性思维能力，而非简单禁止使用"
      ]
    },
    "timestamp": "2025-08-20 23:53:28"
  },
  {
    "seed_question": {
      "id": 5,
      "question": "气候变化是否是人类面临的最大威胁？",
      "category": "环境",
      "difficulty": "高"
    },
    "expanded_data": {
      "core_question": "气候变化是否是人类面临的最大威胁？",
      "sub_questions": [
        "气候变化的影响范围和严重程度如何与其他全球性威胁（如核战争、流行病、人工智能风险）相比较？",
        "气候变化的时间尺度和不可逆性如何影响其威胁等级的评估？",
        "不同地区和人群面对气候变化的脆弱性是否存在显著差异？",
        "现有的气候缓解和适应措施是否足以应对气候变化的威胁？",
        "气候变化是否会引发连锁反应，导致其他威胁（如资源冲突、大规模移民）的加剧？"
      ],
      "key_concepts": [
        "全球性生存威胁",
        "气候变化的不可逆性",
        "威胁的时间紧迫性",
        "威胁的规模和范围",
        "人类系统的脆弱性",
        "缓解与适应能力",
        "风险叠加效应",
        "代际公平问题"
      ],
      "perspectives": [
        "气候变化是最紧迫的生存威胁：因其全球性、不可逆性和对文明基础的破坏性",
        "气候变化是重要威胁但非最大威胁：核战争或失控的人工智能可能带来更直接的灭绝风险",
        "威胁的评估具有地域差异性：对某些地区是生存威胁，对其他地区只是重大挑战",
        "威胁的复合性观点：气候变化会放大其他威胁，形成威胁集群而非单一最大威胁",
        "人类韧性观点：人类有能力适应气候变化，其威胁被过度夸大"
      ],
      "possible_conclusions": [
        "气候变化确实是人类面临的最大单一威胁，因其全球性、长期性和系统性影响",
        "气候变化是重大威胁，但核战争或生物工程风险可能构成更直接的生存危机",
        "最大威胁的认定取决于时间尺度：短期看其他威胁更紧迫，长期看气候变化更致命",
        "不存在单一'最大威胁'，多种威胁相互关联形成复合性危机",
        "威胁评估具有主观性：取决于价值观、地域位置和风险偏好的不同"
      ]
    },
    "timestamp": "2025-08-20 23:53:53"
  }
]